/*=============================================================================
// Fast 2011/08/31
// Last 2022/05/31  Ver1.10                                      (c)Tsuyoshi.A
=============================================================================*/
#ifndef _MTO_DIR_H_
#define _MTO_DIR_H_

// POSIX準拠の環境のみ使える
#if defined(LINUX) || defined(UNIX)

#include <dirent.h>
#include <sys/stat.h>

struct DirInfo { 
    DIR     *pDir;
    char    path[_MAX_PATH];
};

/*=======================================================================
【機能】ディレクトリオープン
【引数】pDirInfo: ディレクトリ情報のポインタ
        path    : ディレクトリパス(末尾の"/"は不要)
【戻値】true: オープン成功
 =======================================================================*/
bool mto_dir_open(struct DirInfo *pDirInfo, const char *path);

/*=======================================================================
【機能】ファイルパスの取得
【引数】pDirInfo: ディレクトリ情報のポインタ 
        pOutPath: ファイルパス保存先
        pathSize: ファイルパス保存先のサイズ
        bDir    : ファイル名にパスをつける？
【戻値】falseで終了 
 =======================================================================*/
bool mto_dir_get_filepath(struct DirInfo *pDirInfo, char *pOutPath, const uint32_t pathSize, const bool bDir);

/*=======================================================================
【機能】ディレクトリパスの取得
【引数】pDirInfo: ディレクトリ情報のポインタ 
        pOutPath: ディレクトリパス保存先
        pathSize: ディレクトリパス保存先のサイズ
        bDir    : ディレクトリにパスをつける？
【戻値】falseで終了 
 =======================================================================*/
bool mto_dir_get_dirpath(struct DirInfo *pDirInfo, char *pOutPath, const uint32_t pathSize, const bool bDir);

/*=======================================================================
【機能】ディレクトリストリームを先頭に移動
【引数】pDirInfo: ディレクトリ情報のポインタ 
【戻値】なし
 =======================================================================*/
void mto_dir_seek_set(struct DirInfo *pDirInfo);

/*=======================================================================
【機能】ディレクトリパスの取得
【引数】pDirInfo: ディレクトリ情報のポインタ 
【戻値】ディレクトリパスのポインタ
 =======================================================================*/
const char *mto_dir_get_dirinfo_path(const struct DirInfo *pDirInfo);

/*=======================================================================
【機能】ディレクトリクローズ
【引数】pDirInfo: ディレクトリ情報のポインタ 
【戻値】ディレクトリパスのポインタ
 =======================================================================*/
void mto_dir_close(struct DirInfo *pDirInfo);

#endif // LINUX
#endif
